""" Задание 1
Пользователь вводит с клавиатуры три числа. В зависимости от выбора пользователя программа выводит
на экран сумму трёх чисел или произведение трёх чисел. """

#Uncomment for run
""" num1 = float(input("Enter 1st number:"))
num2 = float(input("Enter 2nd number:"))
num3 = float(input("Enter 3rd number:"))

action = int(input("What action do you want to do? Enter 1 for Sum, or 2 for multiplying:"))

if action == 1:
    print("Sum of num1+num2+num3 =",num1+num2+num3)
elif action == 2:
    print("Multiplying of num1*num2*num3 =",num1*num2*num3)
else:
    print("Wrong action is entered. Only 1 or 2!")
 """

""" Задание 2
Пользователь вводит с клавиатуры три числа. В зависимости от выбора пользователя программа выводит
на экран максимум из трёх, минимум из трёх или среднеарифметическое трёх чисел.
 """
#Uncomment for run
""" num1 = float(input("Enter 1st number:"))
num2 = float(input("Enter 2nd number:"))
num3 = float(input("Enter 3rd number:"))

action = int(input("What action do you want to do? Enter 1 for Max from 3, or 2 Min from 3, or 3 for Average of 3:"))

num_array = [num1, num2, num3]

if action == 1:
    print("Maximum is:",max(num_array))
elif action == 2:
    print("Minimum is:",min(num_array))
elif action == 3:
    print("Average is:",sum(num_array)/len(num_array))
else:
    print("Wrong action is entered. Only 1,2 or 3!") """

""" Задание 3
Пользователь вводит с клавиатуры количество метров. В зависимости от выбора пользователя программа
переводит метры в мили, дюймы или ярды """
#Uncomment for run

""" meters = float(input("Enter size in meters:"))

converted_lengh = int(input("To convert meters: in miles put 1, in inches put 2, in yards put 3:"))

if converted_lengh == 1:
    print("Miles =", converted_lengh/1609)
elif converted_lengh == 2:
    print("Inches =", converted_lengh*39.37)
elif converted_lengh == 3:
    print("Yards =", converted_lengh*1.094)
else:
    print("Wrong action is entered. Only 1,2 or 3!") """