#Задание 1
"""Пользователь вводит с клавиатуры номер дня недели
(1-7). Необходимо вывести на экран названия дня недели. Например, если 1, то на экране надпись понедельник,
2 — вторник и т.д.  """

#uncomment to run
""" 
day = int(input("Input week day Mon-Su by number 1-7:"))

if day == 1:
    print("Monday")
elif day == 2:
        print("Tuesday")
elif day == 3:
        print("Wednesday")
elif day == 4:
        print("Thursday")
elif day == 5:
        print("Friday")
elif day == 6:
        print("Saturday")
elif day == 7:
        print("Sunday")
else:
    print("Wrong number of the week! Try again.")
 """


#Задание 2
""" Пользователь вводит с клавиатуры номер месяца
(1-12). Необходимо вывести на экран название месяца.
Например, если 1, то на экране надпись январь, 2 — февраль и т.д. 
 """
#uncomment to run
""" month = int(input("Input month Jan-Dec by number 1-12:"))

if month == 1:
    print("January")
elif month == 2:
        print("February")
elif month == 3:
        print("March")
elif month == 4:
        print("April")
elif month == 5:
        print("May")
elif month == 6:
        print("June")
elif month == 7:
        print("July")
elif month == 8:
        print("August")
elif month == 9:
        print("September")
elif month == 10:
        print("October")
elif month == 11:
        print("November")
elif month == 12:
        print("December")
else:
    print("Wrong number of the month! Try again.") """

""" Задание 3
Пользователь вводит с клавиатуры число. Если число
больше нуля нужно вывести надпись «Number is positive»,
если меньше нуля «Number is negative», если равно нулю
«Number is equal to zero»
 """
#uncomment to run
""" number = float(input("Please input a number - negative or positive or zero:"))
if number == 0:
    print("Number is equal to zero")
elif number > 0:
    print("Number is positive")
else:
    print("Number is negative") """